# DS-SF-36 | 05 | Exploratory Data Analysis | Codealong | Starter Code

In [2]:
import os

import math

import numpy as np
import pandas as pd
pd.set_option('display.max_rows', 20)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')

## Part A | Activity | _pandas_

In [3]:
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Carol', 'Dave', 'Eve', 'Frank'],
    'gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'age': [24, 34, 44, 41, 52, 43],
    'marital_status': [0, 2, 1, 2, 0, 1]}).\
        set_index('name')

In [4]:
df

       age  gender  marital_status
name
Alice   24  Female               0
Bob     34    Male               2
Carol   44  Female               1
Dave    41    Male               2
Eve     52  Female               0
Frank   43    Male               1

> ### Question 1.  Subset the dataframe on the age and gender columns

In [20]:
# TODO
df[['age', 'gender']]

       age  gender
name
Alice   24  Female
Bob     34    Male
Carol   44  Female
Dave    41    Male
Eve     52  Female
Frank   43    Male

> ### Question 2.  Subset the dataframe on the age column alone, first as a `DataFrame`, then as a `Series`

In [10]:
# TODO (DataFrame)
df[['age']]

       age
name
Alice   24
Bob     34
Carol   44
Dave    41
Eve     52
Frank   43

In [24]:
# TODO (Series)
# df['age'] -> works
df.age

name
Alice    24
Bob      34
Carol    44
Dave     41
Eve      52
Frank    43
Name: age, dtype: int64

> ### Question 3.  Subset the dataframe on the rows Bob and Carol

In [25]:
# TODO
# df.iloc[1:3] 
df.loc[['Bob', 'Carol']]

       age  gender  marital_status
name
Bob     34    Male               2
Carol   44  Female               1

> ### Question 4.  Subset the dataframe on the row Eve alone, first as a `DataFrame`, then as a `Series`

In [26]:
# TODO (DataFrame)
df.loc[['Eve']]

      age  gender  marital_status
name
Eve    52  Female               0

In [27]:
# TODO (Series)
df.loc['Eve']

age                   52
gender            Female
marital_status         0
Name: Eve, dtype: object

> ### Question 5.  How old is Frank?

In [29]:
# TODO
df.loc['Frank'].age

43

In [30]:
df.age['Frank']

43

In [31]:
df.age.Frank

43

> ### Question 6.  What is the men’s mean age, the women’s median age?

In [42]:
# TODO
df[['gender', 'age']].groupby('gender').mean().loc['Male'].age

39.333333333333336

In [43]:
df[df.gender == 'Male'].age.mean()

39.333333333333336

## Part B

In [45]:
df[df.gender == 'Female'].age.median()

44.0

- `.mean()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.mean.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.mean.html)
- `.var()`, `.std()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.var.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.var.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.std.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.std.html)

In [46]:
df = pd.read_csv(os.path.join('..', 'datasets', 'dataset-05-zillow.csv'), index_col = 'ID')

In [47]:
df

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Beds,Baths,Size,LotSize,BuiltInYear
ID,,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",37.805103,-122.412856,12/4/15,0.7100,...,1.0,NaN,550.0,NaN,1980.0
15063505,"740 Francisco St, San Francisco, CA",37.804420,-122.417389,11/30/15,2.1500,...,NaN,2.0,1430.0,2435.0,1948.0
15063609,"819 Francisco St, San Francisco, CA",37.803728,-122.419055,11/12/15,5.6000,...,2.0,3.5,2040.0,3920.0,1976.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",37.804392,-122.406590,12/11/15,1.5000,...,1.0,1.0,1060.0,NaN,1930.0
15064257,"111 Chestnut St APT 403, San Francisco, CA",37.804240,-122.405509,1/15/16,0.9700,...,2.0,2.0,1299.0,NaN,1993.0
15064295,"111 Chestnut St APT 702, San Francisco, CA",37.804240,-122.405509,12/17/15,0.9400,...,2.0,2.0,1033.0,NaN,1993.0
15064391,"1821 Grant Ave APT 101, San Francisco, CA",37.803748,-122.408531,12/15/15,0.8350,...,1.0,1.0,1048.0,NaN,1975.0
15064536,"2300 Leavenworth St, San Francisco, CA",37.802408,-122.417537,12/4/15,2.8300,...,3.0,2.0,2115.0,1271.0,1913.0
15064640,"1047-1049 Lombard St, San Francisco, CA",37.801889,-122.418704,1/14/16,4.0500,...,NaN,NaN,4102.0,3049.0,1948.0
15064669,"1055 Lombard St # C, San Francisco, CA",37.801873,-122.418834,12/31/15,2.1900,...,2.0,3.0,1182.0,NaN,1986.0
...,...,...,...,...,...,...,...,...,...,...,...
2108546010,"1738 Lombard St APT 4, San Francisco, CA",37.800910,-122.430229,1/14/16,1.4000,...,2.0,2.0,NaN,NaN,2004.0
2114498518,"201 Sansome St UNIT 501, San Francisco, CA",37.792255,-122.401245,1/26/16,0.7575,...,1.0,1.0,658.0,NaN,1909.0
2121221385,"925 Larkin St, San Francisco, CA",37.786427,-122.418222,11/30/15,1.4300,...,NaN,NaN,6600.0,NaN,1907.0
2121978635,"829 Folsom St UNIT 906, San Francisco, CA",37.781429,-122.401860,12/6/15,0.6750,...,1.0,1.0,557.0,NaN,2010.0
2122992200,"129 Octavia St, San Francisco, CA",37.773192,-122.424037,11/20/15,2.7500,...,NaN,NaN,3655.0,NaN,1883.0
2124214951,"412 Green St APT A, San Francisco, CA",37.800040,-122.406100,1/15/16,0.3900,...,NaN,1.0,264.0,NaN,2012.0
2126960082,"355 1st St UNIT 1905, San Francisco, CA",37.787029,-122.393638,11/20/15,0.8600,...,1.0,1.0,691.0,NaN,2004.0
2128308939,"33 Santa Cruz Ave, San Francisco, CA",37.709136,-122.465332,12/10/15,0.8300,...,3.0,3.0,1738.0,2299.0,1976.0
2131957929,"1821 Grant Ave, San Francisco, CA",37.803760,-122.408531,12/15/15,0.8350,...,2.0,2.0,1048.0,NaN,1975.0
2136213970,"1200 Gough St, San Francisco, CA",37.784770,-122.424100,1/10/16,0.8250,...,1.0,1.0,900.0,NaN,1966.0

### `Series.mean()` - Compute the `Series` mean value

In [48]:
df.SalePrice.mean()

1.3974229429999998

> #### Activity: What's `Size`'s mean?

In [ ]:
# TODO

> #### Activity: What fraction of the properties sold in the dataset are studios?

In [ ]:
# TODO

### `DataFrame.mean()` - Compute the `DataFrame` mean value

In [ ]:
# TODO

### `.var()` - Compute the unbiased variance (normalized by `N-1` by default)

In [ ]:
# TODO

> #### Activity: What's the variance for the number of beds in the dataset?

In [ ]:
# TODO

### `.std()` - Compute the unbiased standard deviation (normalized by `N-1` by default)

In [ ]:
# TODO

> #### Activity: What's the standard deviation for the number of beds in the dataset?

In [ ]:
# TODO

## Part C

- `.median()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.median.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.median.html)
- `.count()`, `.sum()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.count.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.count.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sum.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.sum.html)
- `.count()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html)
- `.min()`, `.max()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.min.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.min.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.max.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.max.html)
- `.quantile()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.quantile.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.quantile.html)
- `.describe()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html)

### `.median()` - Compute the median value

In [ ]:
# TODO

> #### Activity: What's the median sale price for properties in the dataset?

In [ ]:
# TODO

### `.count()` - Compute the number of rows/observations without `NaN` and `.sum()` - Compute the sum of the values

In [ ]:
df.count()

In [ ]:
df.IsAStudio.count()

`count()` counts the number of non-`NaN` values:

In [ ]:
df.IsAStudio.dropna().shape[0]

In [ ]:
df.IsAStudio.isnull().sum()

Which leaves 14 houses for which we don't know if they are studios or not.

In [ ]:
df.IsAStudio.dropna().shape[0] + df.IsAStudio.isnull().sum()

In [ ]:
df.IsAStudio.sum()

29 properties are studios.

### `.min()` and `.max()` - Compute the minimum and maximum values

In [50]:
df.min()

Address        1 Crescent Way APT 1402, San Francisco, CA
Latitude                                          37.7084
Longitude                                        -122.511
DateOfSale                                        1/10/16
SalePrice                                           1e-06
IsAStudio                                               0
Beds                                                    1
Baths                                                   1
Size                                                  264
LotSize                                                44
BuiltInYear                                          1870
dtype: object

> #### Activity: What are properties that were sold at the lowest price?  At what price?

In [55]:
# TODO
df[df.SalePrice == df.SalePrice.min()]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Beds,Baths,Size,LotSize,BuiltInYear
ID,,,,,,,,,,,
15149005,"251-253 Missouri St, San Francisco, CA",37.763202,-122.39627,12/23/15,0.000001,...,7.0,6.0,2904.0,2482.0,1900.0

In [ ]:
df.max()

> #### Activity: What are properties that were sold at the highest price?  At what price?

In [ ]:
# TODO

### `.quantile()` - Compute values at the given quantile

In [ ]:
df.quantile(.5)

In [ ]:
df.median()

In [ ]:
df.quantile(.25)

In [ ]:
df.quantile(.75)

### `.describe()` - Generate various summary statistics

In [49]:
df.describe()

,Latitude,Longitude,SalePrice,IsAStudio,Beds,Baths,Size,LotSize,BuiltInYear
count,1000.000000,1000.000000,1000.000000,986.000000,836.000000,942.000000,967.000000,556.000000,975.000000
mean,37.759592,-122.434777,1.397423,0.029412,2.572967,1.977548,1641.300931,3020.640288,1947.533333
std,0.025311,0.031575,1.736413,0.169043,1.250891,1.130334,1027.016175,2853.430139,38.021563
min,37.708438,-122.510650,0.000001,0.000000,1.000000,1.000000,264.000000,44.000000,1870.000000
25%,37.738481,-122.453501,0.800000,0.000000,2.000000,1.000000,1027.500000,2375.000000,1912.000000
50%,37.760234,-122.431664,1.100000,0.000000,2.000000,2.000000,1350.000000,2622.000000,1939.000000
75%,37.779990,-122.409767,1.532500,0.000000,3.000000,2.000000,1947.500000,3049.000000,1986.000000
max,37.805426,-122.371160,32.700000,1.000000,9.000000,14.000000,11500.000000,47916.000000,2015.000000

In [ ]:
df.SalePrice.describe()

In [ ]:
df.Address.describe()

## Part D

- Boxplots
  - (http://pandas.pydata.org/pandas-docs/stable/visualization.html#box-plots)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) with `kind = 'box'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.plot.html) with `kind = 'box'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.boxplot.html)

In [ ]:
df.SalePrice.plot(kind = 'box', figsize = (8, 8))

In [ ]:
df[ ['SalePrice'] ].boxplot(figsize = (8, 8))

> In the same plot, plot the boxplots of `Beds` and `Baths`

In [ ]:
# TODO

## Part E

- Histograms
  - (http://pandas.pydata.org/pandas-docs/stable/visualization.html#histograms)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) with `kind = 'hist'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.plot.html) with `kind = 'hist'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.hist.html)
  - ((http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.hist.html)

In [ ]:
df.Beds.plot(kind = 'hist', figsize = (8, 8))

In [ ]:
df.Beds.hist(figsize = (8, 8))

> #### Activity: In the same plot, plot the histograms of `Beds` and `Baths`

In [ ]:
# TODO

## Part F

- `.mode()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.mode.html)
  - ((http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.mode.html)

### `.mode()` - Compute the mode value(s)

In [ ]:
df.mode()

In [ ]:
df.Address.mode()

In [ ]:
df.Baths.mode()

The `.mode()` method gets the mode(s) of each element along the columns.  Empty if nothing has 2+ occurrences. Adds a row for each mode per label, fills in gaps with `NaN`.  Note that there could be multiple values returned in the columns (when more than one value share the maximum frequency), which is the reason why a dataframe is returned.

In [ ]:
df[df.Address == '1 Mono St # B, San Francisco, CA']

In [ ]:
df[df.Address == '829 Folsom St UNIT 906, San Francisco, CA']

In [ ]:
df[df.Address == '1915 Diamond St, San Francisco, CA']

In [ ]:
df[df.Address == '1954 Golden Gate Ave, San Francisco, CA']

In [ ]:
df[df.Address == '2299 Market St APT 502, San Francisco, CA']

In [ ]:
df[df.Address == '643 Natoma St, San Francisco, CA']

In [ ]:
df[df.Address == '829 Folsom St UNIT 906, San Francisco, CA']

All duplicate entries...

In [ ]:
df[df.DateOfSale == '11/20/15']

In [ ]:
df[df.DateOfSale == '11/20/15'].shape[0]

In [ ]:
(df.DateOfSale == '11/20/15').sum()

## Part G

- `.corr()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.corr.html)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.corr.html)
- Heatmaps
  - (http://matplotlib.org/api/pyplot_api.html#matplotlib.pyplot.matshow)
- Scatter plots
  - (http://pandas.pydata.org/pandas-docs/stable/visualization.html#scatter-plot)
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) with `kind = 'scatter'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.plot.html) with `kind = 'scatter'`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.scatter.html)
- Scatter matrices
  - (http://pandas.pydata.org/pandas-docs/stable/visualization.html#scatter-matrix-plot)

In [ ]:
df.corr()

In [ ]:
df.Beds.corr(df.Baths)

### Heatmaps

In [ ]:
corr = df.corr()

corr

In [ ]:
# TODO

Let's pretty this up.

In [ ]:
list(corr.columns)

In [ ]:
figure = plt.figure()
subplot = figure.add_subplot(1, 1, 1)
figure.colorbar(subplot.matshow(corr))
subplot.set_xticklabels([None] + list(corr.columns), rotation = 90)
subplot.set_yticklabels([None] + list(corr.columns))

### Scatter plots

In [ ]:
df.plot(kind = 'scatter', x = 'Beds', y = 'Baths', s = 100, figsize = (8, 8))

In [ ]:
df.plot.scatter(x = 'Beds', y = 'Baths', s = 100, figsize = (8, 8))

### Scatter matrices

In [ ]:
pd.tools.plotting.scatter_matrix(df[ ['Beds', 'Baths'] ], diagonal = 'kde', s = 500, figsize = (8, 8))

In [ ]:
pd.tools.plotting.scatter_matrix(df[ ['SalePrice', 'Size'] ], s = 200, figsize = (8, 8))

## Part H

- `.value_counts()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html)
- `.crosstab()`
  - (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.crosstab.html)

> #### Activity: Reproduce the `Beds` histogram above.  For each possible number of beds, how many properties share that bed count?

In [ ]:
# TODO

> Careful on checking for `NaN` values!

In [ ]:
# TODO

> #### Activity: Create a frequency table for `Baths` over `Beds`

In [ ]:
# TODO

> #### Activity: Create a frequency table for `Beds` and `Baths` (together) over the centry the houses were built

In [ ]:
# TODO

## Part I

- Geo-location
  - (https://github.com/pbugnion/gmaps)
  - (http://jupyter-gmaps.readthedocs.io/en/latest/authentication.html)
  - (http://jupyter-gmaps.readthedocs.io/en/latest/api.html)

- To install `gmaps`:
  - `$ conda install -c conda-forge gmaps`

In [ ]:
import yaml
import gmaps

with open('google.yaml', 'r') as f:
    google_credentials = yaml.load(f)

google_api_key = google_credentials['api-key']

gmaps.configure(api_key = google_api_key)

In [ ]:
locations_df = df[ ['Latitude', 'Longitude'] ]

In [ ]:
figure = gmaps.figure()
figure.add_layer(gmaps.symbol_layer(locations_df, fill_color = 'yellow', stroke_color = '#ffcc00', scale = 2))
figure

In [ ]:
figure = gmaps.figure()
figure.add_layer(gmaps.heatmap_layer(locations_df))
figure